Dataset/data_test/k8s-sn-wrk-mixed-c6525-25g-exp13-havail0-hori1-verti0-infi1-client-t8-c512-d30-R500-N4
No argument supplied nginx
using  args: threads=8 and connections=512 and duration=30 and requests=500
Running 30s test @ http://localhost:8080
  8 threads and 512 connections
  Thread calibration: mean lat.: 5.852ms, rate sampling interval: 15ms
  Thread calibration: mean lat.: 5.882ms, rate sampling interval: 15ms
  Thread calibration: mean lat.: 5.897ms, rate sampling interval: 15ms
  Thread calibration: mean lat.: 5.976ms, rate sampling interval: 15ms
  Thread calibration: mean lat.: 5.948ms, rate sampling interval: 15ms
  Thread calibration: mean lat.: 5.933ms, rate sampling interval: 15ms
  Thread calibration: mean lat.: 5.865ms, rate sampling interval: 15ms
  Thread calibration: mean lat.: 5.956ms, rate sampling interval: 15ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     5.95ms    1.25ms   9.22ms   69.45%
    Req/Sec    63.56     65.86   266.00     76.81%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.63ms
 75.000%    6.80ms
 90.000%    7.73ms
 99.000%    9.22ms
 99.900%   12.22ms
 99.990%   14.26ms
 99.999%   17.47ms
100.000%   17.47ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.805     0.000000            1         1.00
       4.631     0.100000         1000         1.11
       4.879     0.200000         1981         1.25
       5.107     0.300000         2970         1.43
       5.335     0.400000         3944         1.67
       5.627     0.500000         4933         2.00
       5.807     0.550000         5425         2.22
       6.011     0.600000         5913         2.50
       6.267     0.650000         6406         2.86
       6.527     0.700000         6900         3.33
       6.795     0.750000         7392         4.00
       6.943     0.775000         7643         4.44
       7.071     0.800000         7884         5.00
       7.215     0.825000         8129         5.71
       7.363     0.850000         8375         6.67
       7.531     0.875000         8624         8.00
       7.627     0.887500         8749         8.89
       7.731     0.900000         8866        10.00
       7.835     0.912500         8991        11.43
       7.951     0.925000         9115        13.33
       8.079     0.937500         9236        16.00
       8.163     0.943750         9298        17.78
       8.239     0.950000         9364        20.00
       8.311     0.956250         9421        22.86
       8.391     0.962500         9486        26.67
       8.519     0.968750         9546        32.00
       8.567     0.971875         9574        35.56
       8.647     0.975000         9607        40.00
       8.727     0.978125         9636        45.71
       8.831     0.981250         9667        53.33
       8.975     0.984375         9698        64.00
       9.039     0.985938         9713        71.11
       9.095     0.987500         9728        80.00
       9.159     0.989062         9744        91.43
       9.271     0.990625         9760       106.67
       9.407     0.992188         9775       128.00
       9.439     0.992969         9782       142.22
       9.551     0.993750         9790       160.00
       9.735     0.994531         9798       182.86
       9.871     0.995313         9805       213.33
      10.079     0.996094         9813       256.00
      10.239     0.996484         9817       284.44
      10.351     0.996875         9821       320.00
      10.511     0.997266         9825       365.71
      10.911     0.997656         9828       426.67
      11.079     0.998047         9832       512.00
      11.175     0.998242         9834       568.89
      11.551     0.998437         9836       640.00
      11.687     0.998633         9838       731.43
      12.119     0.998828         9840       853.33
      12.271     0.999023         9842      1024.00
      12.783     0.999121         9843      1137.78
      12.791     0.999219         9844      1280.00
      12.871     0.999316         9845      1462.86
      13.087     0.999414         9846      1706.67
      13.535     0.999512         9847      2048.00
      13.535     0.999561         9847      2275.56
      14.175     0.999609         9848      2560.00
      14.175     0.999658         9848      2925.71
      14.199     0.999707         9849      3413.33
      14.199     0.999756         9849      4096.00
      14.199     0.999780         9849      4551.11
      14.263     0.999805         9850      5120.00
      14.263     0.999829         9850      5851.43
      14.263     0.999854         9850      6826.67
      14.263     0.999878         9850      8192.00
      14.263     0.999890         9850      9102.22
      17.471     0.999902         9851     10240.00
      17.471     1.000000         9851          inf
#[Mean    =        5.953, StdDeviation   =        1.248]
#[Max     =       17.456, Total count    =         9851]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  14768 requests in 30.07s, 183.00MB read
  Socket errors: connect 0, read 0, write 0, timeout 1043
Requests/sec:    491.20
Transfer/sec:      6.09MB