Dataset/data_test/k8s-sn-wrk-mixed-c6525-25g-exp15-havail1-hori1-verti1-infi1-client-t8-c512-d30-R3000-N4
No argument supplied nginx
using  args: threads=8 and connections=512 and duration=30 and requests=3000
Running 30s test @ http://localhost:8080
  8 threads and 512 connections
  Thread calibration: mean lat.: 3019.200ms, rate sampling interval: 11796ms
  Thread calibration: mean lat.: 3204.055ms, rate sampling interval: 12713ms
  Thread calibration: mean lat.: 3041.169ms, rate sampling interval: 12255ms
  Thread calibration: mean lat.: 3137.062ms, rate sampling interval: 12197ms
  Thread calibration: mean lat.: 3049.847ms, rate sampling interval: 11911ms
  Thread calibration: mean lat.: 3298.777ms, rate sampling interval: 12607ms
  Thread calibration: mean lat.: 2836.084ms, rate sampling interval: 11452ms
  Thread calibration: mean lat.: 2950.980ms, rate sampling interval: 11239ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    13.58s     4.43s   22.63s    60.68%
    Req/Sec   109.62      4.33   116.00     62.50%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   13.52s 
 75.000%   17.19s 
 90.000%   19.60s 
 99.000%   22.63s 
 99.900%   24.15s 
 99.990%   25.67s 
 99.999%   26.33s 
100.000%   26.33s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    2359.295     0.000000            1         1.00
    7782.399     0.100000         1782         1.11
    9166.847     0.200000         3568         1.25
   10600.447     0.300000         5350         1.43
   12034.047     0.400000         7135         1.67
   13516.799     0.500000         8917         2.00
   14221.311     0.550000         9801         2.22
   14909.439     0.600000        10692         2.50
   15712.255     0.650000        11584         2.86
   16457.727     0.700000        12477         3.33
   17186.815     0.750000        13367         4.00
   17580.031     0.775000        13813         4.44
   17940.479     0.800000        14279         5.00
   18333.695     0.825000        14712         5.71
   18726.911     0.850000        15149         6.67
   19152.895     0.875000        15593         8.00
   19365.887     0.887500        15832         8.89
   19595.263     0.900000        16050        10.00
   19791.871     0.912500        16261        11.43
   20070.399     0.925000        16495        13.33
   20332.543     0.937500        16714        16.00
   20479.999     0.943750        16823        17.78
   20627.455     0.950000        16929        20.00
   20840.447     0.956250        17046        22.86
   21037.055     0.962500        17153        26.67
   21282.815     0.968750        17265        32.00
   21479.423     0.971875        17322        35.56
   21610.495     0.975000        17376        40.00
   21757.951     0.978125        17434        45.71
   21970.943     0.981250        17489        53.33
   22183.935     0.984375        17545        64.00
   22298.623     0.985938        17571        71.11
   22446.079     0.987500        17600        80.00
   22560.767     0.989062        17627        91.43
   22659.071     0.990625        17655       106.67
   22773.759     0.992188        17681       128.00
   22872.063     0.992969        17695       142.22
   22953.983     0.993750        17709       160.00
   23101.439     0.994531        17724       182.86
   23232.511     0.995313        17740       213.33
   23314.431     0.996094        17753       256.00
   23347.199     0.996484        17760       284.44
   23412.735     0.996875        17767       320.00
   23592.959     0.997266        17773       365.71
   23674.879     0.997656        17779       426.67
   23855.103     0.998047        17786       512.00
   23953.407     0.998242        17789       568.89
   24018.943     0.998437        17794       640.00
   24051.711     0.998633        17797       731.43
   24100.863     0.998828        17800       853.33
   24150.015     0.999023        17803      1024.00
   24231.935     0.999121        17805      1137.78
   24281.087     0.999219        17807      1280.00
   24330.239     0.999316        17808      1462.86
   24379.391     0.999414        17810      1706.67
   24543.231     0.999512        17812      2048.00
   24625.151     0.999561        17813      2275.56
   24690.687     0.999609        17815      2560.00
   24690.687     0.999658        17815      2925.71
   24690.687     0.999707        17815      3413.33
   25542.655     0.999756        17816      4096.00
   25559.039     0.999780        17817      4551.11
   25559.039     0.999805        17817      5120.00
   25559.039     0.999829        17817      5851.43
   25673.727     0.999854        17818      6826.67
   25673.727     0.999878        17818      8192.00
   26312.703     0.999890        17819      9102.22
   26312.703     0.999902        17819     10240.00
   26312.703     0.999915        17819     11702.86
   26312.703     0.999927        17819     13653.33
   26312.703     0.999939        17819     16384.00
   26329.087     0.999945        17820     18204.44
   26329.087     1.000000        17820          inf
#[Mean    =    13583.841, StdDeviation   =     4428.389]
#[Max     =    26312.704, Total count    =        17820]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  27057 requests in 30.06s, 305.48MB read
  Socket errors: connect 0, read 0, write 0, timeout 2
  Non-2xx or 3xx responses: 820
Requests/sec:    900.09
Transfer/sec:     10.16MB